# Select a single column from a DataFrame.

In [2]:
import pandas as pd
import numpy as np

In [3]:
df=pd.DataFrame({
    'Stundent':['Maqbool','Swalih','Akash',"Husna"],
    'Course':['Python','Devops','Data Science','Python'],
    'Gender':['M','M',"M","F"]
})

In [4]:
df

  Stundent        Course Gender
0  Maqbool        Python      M
1   Swalih        Devops      M
2    Akash  Data Science      M
3    Husna        Python      F

In [6]:
df[['Stundent']]

  Stundent
0  Maqbool
1   Swalih
2    Akash
3    Husna

# Select specific rows using iloc[].

In [7]:
df

  Stundent        Course Gender
0  Maqbool        Python      M
1   Swalih        Devops      M
2    Akash  Data Science      M
3    Husna        Python      F

In [10]:
df.iloc[1:3,:]

  Stundent        Course Gender
1   Swalih        Devops      M
2    Akash  Data Science      M

# Apply conditional filtering (Age > 30).

In [11]:
df['Age']=[21,21,24,21]

In [15]:
df[df['Age']>22]

  Stundent        Course Gender  Age
2    Akash  Data Science      M   24

# Select the first 3 rows of a DataFrame.

In [17]:
df

  Stundent        Course Gender  Age
0  Maqbool        Python      M   21
1   Swalih        Devops      M   21
2    Akash  Data Science      M   24
3    Husna        Python      F   21

In [18]:
df.head(3)

  Stundent        Course Gender  Age
0  Maqbool        Python      M   21
1   Swalih        Devops      M   21
2    Akash  Data Science      M   24

# Select only the Name column.

In [19]:
df

  Stundent        Course Gender  Age
0  Maqbool        Python      M   21
1   Swalih        Devops      M   21
2    Akash  Data Science      M   24
3    Husna        Python      F   21

In [21]:
df[['Stundent']]

  Stundent
0  Maqbool
1   Swalih
2    Akash
3    Husna

# Filter rows where Age > 22.

In [24]:
df

  Stundent        Course Gender  Age
0  Maqbool        Python      M   21
1   Swalih        Devops      M   21
2    Akash  Data Science      M   24
3    Husna        Python      F   21

In [26]:
df[df["Age"]>22]

  Stundent        Course Gender  Age
2    Akash  Data Science      M   24

# Select rows 2–4 and columns Name and Age using iloc[].

In [27]:
df

  Stundent        Course Gender  Age
0  Maqbool        Python      M   21
1   Swalih        Devops      M   21
2    Akash  Data Science      M   24
3    Husna        Python      F   21

In [31]:
df.iloc[:2,3:4]

   Age
0   21
1   21

# Filter rows where Salary is between 50,000 and 80,000.

In [32]:
df1=pd.DataFrame({
     "Name": ["Arun", "Meera", "Kiran", "Anu", "Ravi"],
    "Age": [22, 29, 26, 28, 24],
    "Salary": [45000, 55000, 75000, 90000, 60000]
})

In [33]:
df1

    Name  Age  Salary
0   Arun   22   45000
1  Meera   29   55000
2  Kiran   26   75000
3    Anu   28   90000
4   Ravi   24   60000

In [42]:
fil=df1[(df1['Salary']>=50000) & (df1['Salary']<=80000)]

In [43]:
fil

    Name  Age  Salary
1  Meera   29   55000
2  Kiran   26   75000
4   Ravi   24   60000